In [117]:
pwd

'/Users/kelly/ds/metis/metisgh/prework'

In [2]:
import pandas as pd

In [119]:
#pd.read_csv('zip_donor_NY_by_zip (1).csv')

In [120]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import datetime
from datetime import datetime as dt

In [5]:
#Targeting data in April 2018 to determine resource deployment for gala in June 2019

def get_data(week_nums):
    url = ("http://web.mta.info/developers/data/nyct/turnstile/turnstile_{}.txt")
    df = []
    for week in week_nums:
        week_url = url.format(week)
        df.append(pd.read_csv(week_url))
    return pd.concat(df)

week_nums = [180407, 180414, 180421, 180428]
mta_df = get_data(week_nums)

In [6]:
mta_df.head()

,C/A,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/31/2018,00:00:00,REGULAR,6566463,2224050
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/31/2018,04:00:00,REGULAR,6566470,2224053
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/31/2018,08:00:00,REGULAR,6566470,2224053
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/31/2018,12:00:00,REGULAR,6566470,2224055
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/31/2018,16:00:00,REGULAR,6566470,2224055

In [7]:
mta_df.tail()

,C/A,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS
197574,TRAM2,R469,00-03-01,RIT-ROOSEVELT,R,RIT,04/27/2018,05:00:00,REGULAR,2877053,386148
197575,TRAM2,R469,00-03-01,RIT-ROOSEVELT,R,RIT,04/27/2018,09:00:00,REGULAR,2877060,386149
197576,TRAM2,R469,00-03-01,RIT-ROOSEVELT,R,RIT,04/27/2018,13:00:00,REGULAR,2877136,386151
197577,TRAM2,R469,00-03-01,RIT-ROOSEVELT,R,RIT,04/27/2018,17:00:00,REGULAR,2877237,386156
197578,TRAM2,R469,00-03-01,RIT-ROOSEVELT,R,RIT,04/27/2018,21:00:00,REGULAR,2877307,386159

In [8]:
mta_df.columns

Index(['C/A', 'UNIT', 'SCP', 'STATION', 'LINENAME', 'DIVISION', 'DATE', 'TIME',
       'DESC', 'ENTRIES',
       'EXITS                                                               '],
      dtype='object')

In [9]:
mta_df.DATE.value_counts().sort_index()

03/31/2018    28129
04/01/2018    28084
04/02/2018    28049
04/03/2018    28189
04/04/2018    28154
04/05/2018    28262
04/06/2018    28121
04/07/2018    28161
04/08/2018    28132
04/09/2018    28036
04/10/2018    28085
04/11/2018    28087
04/12/2018    27981
04/13/2018    28109
04/14/2018    28183
04/15/2018    28155
04/16/2018    28087
04/17/2018    28091
04/18/2018    28098
04/19/2018    28330
04/20/2018    28244
04/21/2018    28185
04/22/2018    28280
04/23/2018    28374
04/24/2018    28264
04/25/2018    28325
04/26/2018    28105
04/27/2018    28046
Name: DATE, dtype: int64

In [10]:
#Create new date time field

mta_df['DATE_TIME'] = pd.to_datetime(mta_df['DATE']+ ' ' + mta_df['TIME'], format = "%m/%d/%Y %H:%M:%S")

In [11]:
mta_df.head()

,C/A,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS,DATE_TIME
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/31/2018,00:00:00,REGULAR,6566463,2224050,2018-03-31 00:00:00
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/31/2018,04:00:00,REGULAR,6566470,2224053,2018-03-31 04:00:00
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/31/2018,08:00:00,REGULAR,6566470,2224053,2018-03-31 08:00:00
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/31/2018,12:00:00,REGULAR,6566470,2224055,2018-03-31 12:00:00
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/31/2018,16:00:00,REGULAR,6566470,2224055,2018-03-31 16:00:00

In [12]:
#Check for unique entries

(mta_df
 .groupby(by = ['C/A','UNIT','SCP','STATION','DATE_TIME'])
 .ENTRIES.count()
 .reset_index()
 .sort_values("ENTRIES")).tail()

          C/A  UNIT       SCP          STATION           DATE_TIME  ENTRIES
262785   N141  R356  00-00-02  OZONE PK LEFFRT 2018-04-09 00:00:00        1
262786   N141  R356  00-00-02  OZONE PK LEFFRT 2018-04-09 04:00:00        1
262765   N141  R356  00-00-02  OZONE PK LEFFRT 2018-04-05 16:00:00        1
788344  TRAM2  R469  00-03-01    RIT-ROOSEVELT 2018-04-27 21:00:00        1
267110   N183  R415  00-00-00    BROAD CHANNEL 2018-04-04 05:00:00        2

In [13]:
#On April 4th we have two entries for Broad Channel 

duplicate_mask = ((mta_df['C/A'] == 'N183') & 
                  (mta_df['UNIT'] == 'R415') & 
                  (mta_df['SCP'] == '00-00-00') & 
                  (mta_df['STATION'] == 'BROAD CHANNEL') &
                  (mta_df['DATE_TIME'].dt.date == datetime.datetime(2018,4,4).date()))

In [14]:
mta_df[duplicate_mask].head()

,C/A,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS,DATE_TIME
67019,N183,R415,00-00-00,BROAD CHANNEL,AS,IND,04/04/2018,01:00:00,REGULAR,36983,25347,2018-04-04 01:00:00
67020,N183,R415,00-00-00,BROAD CHANNEL,AS,IND,04/04/2018,05:00:00,REGULAR,36995,25351,2018-04-04 05:00:00
67021,N183,R415,00-00-00,BROAD CHANNEL,AS,IND,04/04/2018,05:00:00,RECOVR AUD,36994,25351,2018-04-04 05:00:00
67022,N183,R415,00-00-00,BROAD CHANNEL,AS,IND,04/04/2018,09:00:00,REGULAR,37045,25359,2018-04-04 09:00:00
67023,N183,R415,00-00-00,BROAD CHANNEL,AS,IND,04/04/2018,13:00:00,REGULAR,37050,25366,2018-04-04 13:00:00

In [15]:
# The April 4th data has an entry with the line description 'Recover Aud'
# The entry count for this date is one less than the 'Regular' count and exit count is the same
# We deem this difference immaterial thus conclude it can be ignored for the remainder of the analysis

In [16]:
#Check value count of descriptions before remove duplicate values

mta_df.DESC.value_counts()

REGULAR       786070
RECOVR AUD      2276
Name: DESC, dtype: int64

In [17]:
mta_df.sort_values(["C/A", "UNIT", "SCP", "STATION", "DATE_TIME"], inplace=True, \
                          ascending=False)
mta_df.drop_duplicates(["C/A", "UNIT", "SCP", "STATION", "DATE_TIME"], inplace=True)

In [18]:
#Check that the Broad Channel entry is removed

(mta_df
 .groupby(by = ['C/A','UNIT','SCP','STATION','DATE_TIME'])
 .ENTRIES.count()
 .reset_index()
 .sort_values("ENTRIES")).tail()

          C/A  UNIT       SCP          STATION           DATE_TIME  ENTRIES
262784   N141  R356  00-00-02  OZONE PK LEFFRT 2018-04-08 20:00:00        1
262785   N141  R356  00-00-02  OZONE PK LEFFRT 2018-04-09 00:00:00        1
262786   N141  R356  00-00-02  OZONE PK LEFFRT 2018-04-09 04:00:00        1
262908   N141  R356  00-00-03  OZONE PK LEFFRT 2018-04-01 16:00:00        1
788344  TRAM2  R469  00-03-01    RIT-ROOSEVELT 2018-04-27 21:00:00        1

In [19]:
#Check value count of descriptions after remove duplicate values

mta_df.DESC.value_counts()

REGULAR       786070
RECOVR AUD      2275
Name: DESC, dtype: int64

In [20]:
#Resort data in chronological order

mta_df.sort_values(["C/A", "UNIT", "SCP", "STATION", "DATE_TIME"], inplace=True, \
                          ascending=True)

In [21]:
mta_df.groupby(by = ['C/A', 'UNIT', 'SCP', 'STATION','DATE_TIME']).first().head(10)

                                               LINENAME DIVISION        DATE  \
C/A  UNIT SCP      STATION DATE_TIME
A002 R051 02-00-00 59 ST   2018-03-31 00:00:00  NQR456W      BMT  03/31/2018
                           2018-03-31 04:00:00  NQR456W      BMT  03/31/2018
                           2018-03-31 08:00:00  NQR456W      BMT  03/31/2018
                           2018-03-31 12:00:00  NQR456W      BMT  03/31/2018
                           2018-03-31 16:00:00  NQR456W      BMT  03/31/2018
                           2018-03-31 20:00:00  NQR456W      BMT  03/31/2018
                           2018-04-01 00:00:00  NQR456W      BMT  04/01/2018
                           2018-04-01 04:00:00  NQR456W      BMT  04/01/2018
                           2018-04-01 08:00:00  NQR456W      BMT  04/01/2018
                           2018-04-01 12:00:00  NQR456W      BMT  04/01/2018

                                                    TIME     DESC  ENTRIES  \
C/A  UNIT SCP      STATION DATE_TIME
A002 R051 02-00-00 59 ST   2018-03-31 00:00:00  00:00:00  REGULAR  6566463
                           2018-03-31 04:00:00  04:00:00  REGULAR  6566470
                           2018-03-31 08:00:00  08:00:00  REGULAR  6566470
                           2018-03-31 12:00:00  12:00:00  REGULAR  6566470
                           2018-03-31 16:00:00  16:00:00  REGULAR  6566470
                           2018-03-31 20:00:00  20:00:00  REGULAR  6566470
                           2018-04-01 00:00:00  00:00:00  REGULAR  6566470
                           2018-04-01 04:00:00  04:00:00  REGULAR  6566470
                           2018-04-01 08:00:00  08:00:00  REGULAR  6566470
                           2018-04-01 12:00:00  12:00:00  REGULAR  6566470

                                                EXITS
C/A  UNIT SCP      STATION DATE_TIME
A002 R051 02-00-00 59 ST   2018-03-31 00:00:00                                            2224050
                           2018-03-31 04:00:00                                            2224053
                           2018-03-31 08:00:00                                            2224053
                           2018-03-31 12:00:00                                            2224055
                           2018-03-31 16:00:00                                            2224055
                           2018-03-31 20:00:00                                            2224055
                           2018-04-01 00:00:00                                            2224055
                           2018-04-01 04:00:00                                            2224055
                           2018-04-01 08:00:00                                            2224055
                           2018-04-01 12:00:00                                            2224055

In [22]:
mta_df.groupby(by = ['C/A', 'UNIT', 'SCP', 'STATION', 'DATE_TIME']).last().head(10)

                                               LINENAME DIVISION        DATE  \
C/A  UNIT SCP      STATION DATE_TIME
A002 R051 02-00-00 59 ST   2018-03-31 00:00:00  NQR456W      BMT  03/31/2018
                           2018-03-31 04:00:00  NQR456W      BMT  03/31/2018
                           2018-03-31 08:00:00  NQR456W      BMT  03/31/2018
                           2018-03-31 12:00:00  NQR456W      BMT  03/31/2018
                           2018-03-31 16:00:00  NQR456W      BMT  03/31/2018
                           2018-03-31 20:00:00  NQR456W      BMT  03/31/2018
                           2018-04-01 00:00:00  NQR456W      BMT  04/01/2018
                           2018-04-01 04:00:00  NQR456W      BMT  04/01/2018
                           2018-04-01 08:00:00  NQR456W      BMT  04/01/2018
                           2018-04-01 12:00:00  NQR456W      BMT  04/01/2018

                                                    TIME     DESC  ENTRIES  \
C/A  UNIT SCP      STATION DATE_TIME
A002 R051 02-00-00 59 ST   2018-03-31 00:00:00  00:00:00  REGULAR  6566463
                           2018-03-31 04:00:00  04:00:00  REGULAR  6566470
                           2018-03-31 08:00:00  08:00:00  REGULAR  6566470
                           2018-03-31 12:00:00  12:00:00  REGULAR  6566470
                           2018-03-31 16:00:00  16:00:00  REGULAR  6566470
                           2018-03-31 20:00:00  20:00:00  REGULAR  6566470
                           2018-04-01 00:00:00  00:00:00  REGULAR  6566470
                           2018-04-01 04:00:00  04:00:00  REGULAR  6566470
                           2018-04-01 08:00:00  08:00:00  REGULAR  6566470
                           2018-04-01 12:00:00  12:00:00  REGULAR  6566470

                                                EXITS
C/A  UNIT SCP      STATION DATE_TIME
A002 R051 02-00-00 59 ST   2018-03-31 00:00:00                                            2224050
                           2018-03-31 04:00:00                                            2224053
                           2018-03-31 08:00:00                                            2224053
                           2018-03-31 12:00:00                                            2224055
                           2018-03-31 16:00:00                                            2224055
                           2018-03-31 20:00:00                                            2224055
                           2018-04-01 00:00:00                                            2224055
                           2018-04-01 04:00:00                                            2224055
                           2018-04-01 08:00:00                                            2224055
                           2018-04-01 12:00:00                                            2224055

In [46]:
#Calculate all entries by station by day from midnight through 8pm
#Note that the hours of 8pm to 12pm are excluded

#mta_df['num_ppl'] = mta_df.groupby(by = ['C/A', 'UNIT', 'SCP', 'STATION', 'DATE_TIME'])['ENTRIES'].diff()

In [101]:
mta_df2 = mta_df#.drop(["C/A", "UNIT", "SCP", "LINENAME", "DIVISION", "DESC", "EXITS", "DATE_TIME"], axis=1, errors="ignore")

In [102]:
mta_df2.columns

Index(['C/A', 'UNIT', 'SCP', 'STATION', 'LINENAME', 'DIVISION', 'DATE', 'TIME',
       'DESC', 'ENTRIES', 'EXITS', 'DATE_TIME'],
      dtype='object')

In [103]:
#Remove whitespace after Exits so we can delete that column

mta_df2.columns = [column.strip() for column in mta_df2.columns]
mta_df2.columns

Index(['C/A', 'UNIT', 'SCP', 'STATION', 'LINENAME', 'DIVISION', 'DATE', 'TIME',
       'DESC', 'ENTRIES', 'EXITS', 'DATE_TIME'],
      dtype='object')

In [104]:
mta_df2 = mta_df2.drop(["EXITS", "DATE_TIME"], axis=1, errors="ignore")

In [105]:
mta_df2.head(20)

,C/A,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/31/2018,00:00:00,REGULAR,6566463
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/31/2018,04:00:00,REGULAR,6566470
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/31/2018,08:00:00,REGULAR,6566470
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/31/2018,12:00:00,REGULAR,6566470
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/31/2018,16:00:00,REGULAR,6566470
5,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/31/2018,20:00:00,REGULAR,6566470
6,A002,R051,02-00-00,59 ST,NQR456W,BMT,04/01/2018,00:00:00,REGULAR,6566470
7,A002,R051,02-00-00,59 ST,NQR456W,BMT,04/01/2018,04:00:00,REGULAR,6566470
8,A002,R051,02-00-00,59 ST,NQR456W,BMT,04/01/2018,08:00:00,REGULAR,6566470
9,A002,R051,02-00-00,59 ST,NQR456W,BMT,04/01/2018,12:00:00,REGULAR,6566470
10,A002,R051,02-00-00,59 ST,NQR456W,BMT,04/01/2018,16:00:00,REGULAR,6566470
11,A002,R051,02-00-00,59 ST,NQR456W,BMT,04/01/2018,20:00:00,REGULAR,6566470
12,A002,R051,02-00-00,59 ST,NQR456W,BMT,04/02/2018,00:00:00,REGULAR,6566470
13,A002,R051,02-00-00,59 ST,NQR456W,BMT,04/02/2018,04:00:00,REGULAR,6566470
14,A002,R051,02-00-00,59 ST,NQR456W,BMT,04/02/2018,08:00:00,REGULAR,6566495
15,A002,R051,02-00-00,59 ST,NQR456W,BMT,04/02/2018,12:00:00,REGULAR,6566629
16,A002,R051,02-00-00,59 ST,NQR456W,BMT,04/02/2018,16:00:00,REGULAR,6566839
17,A002,R051,02-00-00,59 ST,NQR456W,BMT,04/02/2018,20:00:00,REGULAR,6567469
18,A002,R051,02-00-00,59 ST,NQR456W,BMT,04/03/2018,00:00:00,REGULAR,6567630
19,A002,R051,02-00-00,59 ST,NQR456W,BMT,04/03/2018,04:00:00,REGULAR,6567630

In [106]:
#mta_df2['incremental_ppl'] = mta_df2['ENTRIES'].diff()

In [107]:
#mta_df2.head(20)

In [108]:
#mta_df2.groupby(by = ['STATION', 'DATE','C/A', 'UNIT', 'SCP'])['incremental_ppl'].sum().head()

In [109]:
#scp_mask = mta_df2['SCP'] =='00-03-01'

In [110]:
#mta_df2[scp_mask]

In [111]:
#station_mask = mta_df2['STATION'] == '59 ST'
#date_mask = mta_df2['DATE'] == '3/31/2018'

In [112]:
#filtered_by_station = mta_df2[station_mask]

In [113]:
#filtered_by_station.DATE.value_counts()

In [114]:
#mta_df2.groupby(by = ['STATION', 'DATE'])[['num_ppl']].sum()

In [115]:
#station_by_day = mta_df2.groupby(by = ['STATION', 'DATE'])[['num_ppl']].sum()
#plt.hist(station_by_day, range = (-10000,10000))

In [116]:
mta_df2.head()

,C/A,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/31/2018,00:00:00,REGULAR,6566463
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/31/2018,04:00:00,REGULAR,6566470
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/31/2018,08:00:00,REGULAR,6566470
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/31/2018,12:00:00,REGULAR,6566470
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/31/2018,16:00:00,REGULAR,6566470

In [ ]:
#DATE_TIME time_series.loc[:, DATE_TIME] - pd.Timedelta(minutes=1)